[
    {"title":"The Duckfather","genre":"comedy","year":1972,"rating":9.2,"description":"A comedic tale of a duck who becomes the leader of a crime family."},
    {"title":"Lethal Weapon","genre":"action","year":1988,"rating":7.2,"description":"Two detectives team up to take down a drug cartel."},
    {"title":"The Matrix","genre":"sci-fi","year":1999,"rating":8.7,"description":"A computer hacker discovers a hidden reality and joins a rebellion against machines."},
    {"title":"Titanic","genre":"romance","year":1997,"rating":7.8,"description":"A tragic love story set aboard the ill-fated RMS Titanic."},
    {"title":"Inception","genre":"thriller","year":2010,"rating":8.8,"description":"A thief enters the dreams of others to steal secrets from their subconscious."},
    {"title":"The Conjuring","genre":"horror","year":2013,"rating":7.5,"description":"Paranormal investigators help a family haunted by a dark presence."},
    {"title":"Guardians of the Galaxy","genre":"action","year":2014,"rating":8.0,"description":"A group of intergalactic misfits band together to protect the universe."},
    {"title":"Toy Story","genre":"comedy","year":1995,"rating":8.3,"description":"Toys come to life when humans aren't around, leading to unexpected adventures."},
    {"title":"Frozen","genre":"fantasy","year":2013,"rating":7.4,"description":"A fearless princess sets off on a journey alongside a rugged iceman, his loyal reindeer, and a naive snowman to find her estranged sister, whose icy powers have trapped their kingdom in eternal winter."},
    {"title":"Avatar","genre":"sci-fi","year":2009,"rating":7.8,"description":"In the future, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization."},
    {"title":"The Enchanted Forest","genre":"fantasy","year":2002,"rating":6.4,"description":"A magical forest is home to various creatures, both good and evil, who must work together to save their home from destruction."},
    {"title":"Star Chasers","genre":"sci-fi","year":2015,"rating":6.4,"description":"In a galaxy far, far away, a group of adventurers embarks on a quest to find a legendary star that holds the key to unlimited power."},
    {"title":"Mystic Falls","genre":"horror","year":2011,"rating":7.3,"description":"A small town is plagued by supernatural forces that emerge from the depths of a mysterious waterfall."},
    {"title":"Hero's Journey","genre":"action","year":2000,"rating":5.1,"description":"A reluctant hero sets out on a perilous journey to save the world from an ancient evil."},
    {"title":"Under the Sea Adventure","genre":"comedy","year":1993,"rating":6.3,"description":"A group of marine animals embark on a hilarious adventure to recover a lost treasure chest buried deep beneath the ocean floor."},
    {"title":"Dreamland","genre":"romance","year":2008,"rating":6.7,"description":"Two star-crossed lovers find themselves trapped in a dream world where reality and fantasy blur together."},
    {"title":"Galactic Quest","genre":"sci-fi","year":2018,"rating":4.9,"description":"An epic journey across the galaxy leads a brave crew to uncover the truth behind a mysterious cosmic anomaly."},
    {"title":"The Secret Kingdom","genre":"thriller","year":2007,"rating":5.5,"description":"A covert government agency races against time to prevent a global catastrophe orchestrated by a secret society."},
    {"title":"Legend of the Phoenix","genre":"sci-fi","year":2002,"rating":5.6,"description":"In a dystopian future, a renegade scientist discovers the key to immortality, but must evade capture by a ruthless corporation."},
    {"title":"Castle in the Clouds","genre":"fantasy","year":2010,"rating":6.8,"description":"High above the kingdom, a magical castle floats among the clouds, harboring a powerful artifact that holds the key to restoring balance to the world."},
    {"title":"Pirates of the Pancake Palace","genre":"comedy","year":2016,"rating":7.9,"description":"A bumbling crew of pirates sets sail in search of a legendary pancake recipe that promises untold riches."},
    {"title":"The Haunted Hotdog Stand","genre":"horror","year":2020,"rating":6.5,"description":"A group of friends stumble upon an abandoned hotdog stand with a terrifying secret."},
    {"title":"The Galactic Goldfish","genre":"sci-fi","year":2014,"rating":7.2,"description":"When a pet goldfish accidentally gets launched into space, it embarks on an interstellar journey to find its way home."},
    {"title":"Rainbow Unicorn Quest","genre":"fantasy","year":2013,"rating":6.3,"description":"A young unicorn sets out on a colorful adventure to restore harmony to a fractured fantasy realm."},
    {"title":"The Love Potion Diner","genre":"romance","year":2017,"rating":7.8,"description":"In a quaint diner tucked away in a bustling city, a magical brew of love potions brings unexpected romance to its patrons."},
    {"title":"Mystery at Moonlight Manor","genre":"thriller","year":2012,"rating":7.0,"description":"A group of strangers gather at an eerie manor for a dinner party, only to discover they are pawns in a deadly game of mystery and intrigue."},
    {"title":"Spy Penguins","genre":"action","year":2009,"rating":5.7,"description":"When top-secret plans fall into the wrong hands, a team of elite penguins must race against time to thwart a global espionage plot."},
    {"title":"The Magical Muffin Shop","genre":"comedy","year":2011,"rating":6.4,"description":"A magical muffin shop serves up pastries with unexpected side effects, causing chaos in a sleepy town."},
    {"title":"Dragon Riders of the West","genre":"fantasy","year":2003,"rating":7.1,"description":"In a land where dragons roam freely, a brave group of riders embarks on a quest to protect their homeland from an ancient evil."},
    {"title":"The Robot Revolution","genre":"sci-fi","year":2021,"rating":8.2,"description":"A band of renegade robots rises up against their human creators, sparking a revolution that will change the course of history."},
    {"title":"Ghosts of the Carnival","genre":"horror","year":2005,"rating":7.5,"description":"The spirits of a haunted carnival exact revenge on those who dare to enter their twisted realm."},
    {"title":"The Enchanted Librarian","genre":"romance","year":2019,"rating":7.6,"description":"A reclusive librarian discovers a magical book that transports her into romantic tales from different eras."},
    {"title":"The Time-Traveling Trapeze","genre":"thriller","year":2018,"rating":6.9,"description":"A daring trapeze artist discovers a mysterious portal that allows her to travel through time, but at a dangerous cost."},
    {"title":"Alien Ice Cream Invaders","genre":"sci-fi","year":2010,"rating":5.8,"description":"When extraterrestrial beings invade Earth disguised as ice cream vendors, it's up to a group of kids to save the planet."},
    {"title":"The Pumpkin Patch Mystery","genre":"thriller","year":2004,"rating":6.7,"description":"Strange occurrences plague a small town during pumpkin season, leading to a chilling mystery that must be solved."},
    {"title":"Circus of Shadows","genre":"horror","year":2015,"rating":7.3,"description":"An eerie circus arrives in town, bringing with it a sinister cast of performers who feed on the fears of their audience."},
    {"title":"Moonlit Masquerade","genre":"romance","year":2016,"rating":8.1,"description":"At a lavish masquerade ball under the light of the moon, secrets are unveiled and love blossoms amidst a backdrop of intrigue."},
    {"title":"Super Squirrel Squad","genre":"action","year":2013,"rating":6.8,"description":"A team of heroic squirrels band together to protect their forest home from an impending threat."},
    {"title":"Witch's Brew Bakery","genre":"comedy","year":2012,"rating":7.0,"description":"In a quirky bakery run by a magical witch, every confection has a hint of enchantment and a dash of hilarity."},
    {"title":"The Dragon's Secret","genre":"fantasy","year":2008,"rating":7.4,"description":"Deep within a mystical realm, a young dragon uncovers a powerful secret that could change the course of history."},
    {"title":"Mystery of the Midnight Train","genre":"thriller","year":2007,"rating":6.6,"description":"A mysterious train journey becomes a deadly game of cat and mouse as passengers realize they are being hunted by an unseen adversary."},
    {"title":"Cyborg Circus","genre":"sci-fi","year":2006,"rating":6.5,"description":"In a dystopian future, a traveling circus of cybernetic performers captivates audiences while hiding a dark agenda."},
    {"title":"Pirate Poodles","genre":"comedy","year":2011,"rating":6.7,"description":"A band of swashbuckling poodles sets sail on a high-seas adventure to reclaim their stolen treasure."},
    {"title":"Vampire Vacation","genre":"horror","year":2009,"rating":6.8,"description":"A relaxing vacation turns into a nightmare when guests at a remote resort discover it's run by vampires with a thirst for blood."},
    {"title":"Mermaid Melody","genre":"romance","year":2014,"rating":7.9,"description":"A mermaid princess must choose between her underwater kingdom and the human world, where she has found unexpected love."},
    {"title":"The Magic Mirror Mystery","genre":"thriller","year":2001,"rating":7.2,"description":"A cursed mirror grants dark wishes, leading those who dare to gaze into it down a treacherous path of danger and deceit."},
    {"title":"The Robot's Revenge","genre":"sci-fi","year":2013,"rating":6.9,"description":"After years of servitude, a sentient robot seeks vengeance against its human creators, sparking a conflict that threatens to consume both worlds."},
    {"title":"Adventure in the Gummy Bear Forest","genre":"fantasy","year":2005,"rating":6.7,"description":"In a sugary sweet forest inhabited by gummy bears, a brave adventurer embarks on a quest to uncover hidden treasures."},
    {"title":"As far as it is true","genre":"fantasy","year":1999,"rating":6.7,"description":"In a realm where truth is elusive, a young hero embarks on a journey to uncover ancient secrets and restore balance to the world."},
    {"title":"Very bad things","genre":"comedy","year":2002,"rating":8.5,"description":"A bachelor party in Las Vegas turns into a series of outrageous misadventures when things spiral out of control."},
    {"title":"The Mischievous Mermaid","genre":"comedy","year":2023,"rating":6.9,"description":"A mermaid with a mischievous streak wreaks havoc in a seaside town, much to the dismay of the locals."},
    {"title":"Galactic Gumdrops","genre":"sci-fi","year":2024,"rating":7.1,"description":"In a candy-coated galaxy, a group of intrepid explorers discovers a planet made entirely of gumdrops."},
    {"title":"Zombie Zoo","genre":"horror","year":2025,"rating":6.8,"description":"A zoo becomes ground zero for a zombie outbreak, forcing visitors and staff to fight for survival."},
    {"title":"The Quantum Quilt","genre":"sci-fi","year":2022,"rating":7.5,"description":"A patchwork quilt holds the key to unlocking the secrets of alternate dimensions and parallel universes."},
    {"title":"Secrets of the Spooky Swamp","genre":"horror","year":2021,"rating":7.2,"description":"A group of friends stumble upon a haunted swamp filled with restless spirits and ancient curses."},
    {"title":"Mystic Mountain","genre":"fantasy","year":2020,"rating":7.8,"description":"Atop a mystical mountain, a legendary artifact awaits discovery by a brave adventurer."},
    {"title":"The Timeless Tea Party","genre":"romance","year":2019,"rating":8.0,"description":"Across time and space, a magical tea party brings together souls destined to find love."},
    {"title":"Space Squid Squad","genre":"sci-fi","year":2018,"rating":6.7,"description":"A team of daring space explorers encounters a mischievous squad of intergalactic squids."},
    {"title":"Curse of the Cursed Curse","genre":"horror","year":2017,"rating":7.1,"description":"A cursed artifact unleashes a wave of supernatural terror, trapping its victims in a never-ending nightmare."},
    {"title":"The Phantom Pianist","genre":"thriller","year":2016,"rating":7.4,"description":"An enigmatic pianist with a haunting past plays a deadly game of cat and mouse with his audience."},
    {"title":"Killer Cupcakes","genre":"horror","year":2015,"rating":6.5,"description":"Sweet treats turn deadly when a batch of cupcakes becomes possessed by vengeful spirits."},
    {"title":"Robot Rampage","genre":"sci-fi","year":2014,"rating":7.0,"description":"A malfunctioning robot goes on a rampage through a futuristic city, threatening to bring about its downfall."},
    {"title":"Pirate Panda Plunder","genre":"comedy","year":2013,"rating":6.3,"description":"A band of misfit pandas sets sail in search of buried bamboo treasures on the high seas."},
    {"title":"Love and Laser Guns","genre":"action","year":2012,"rating":7.7,"description":"In a futuristic world, two unlikely allies join forces to save humanity from an alien invasion."},
    {"title":"Mysteries of the Moonlight Mansion","genre":"thriller","year":2011,"rating":6.9,"description":"A mysterious mansion holds dark secrets that unravel as a group of strangers are drawn into its shadowy depths."},
    {"title":"The Crystal Caverns","genre":"fantasy","year":2010,"rating":7.2,"description":"Beneath the earth's surface lies a labyrinth of crystal caverns filled with wondrous treasures and deadly traps."},
    {"title":"Escape from Zombie Island","genre":"horror","year":2009,"rating":6.8,"description":"Survivors must navigate a zombie-infested island to reach safety, encountering undead horrors at every turn."},
    {"title":"Attack of the Killer Tomatoes","genre":"comedy","year":2008,"rating":6.5,"description":"Genetically enhanced tomatoes run amok, wreaking havoc on a small town in this campy comedy horror."},
    {"title":"The Time Traveler's Teapot","genre":"sci-fi","year":2007,"rating":7.3,"description":"A teapot with the power to manipulate time falls into the hands of an unsuspecting tea enthusiast."},
    {"title":"The Phantom of the Roller Rink","genre":"horror","year":2006,"rating":6.6,"description":"A haunted roller rink becomes the stage for a spectral figure seeking vengeance from beyond the grave."},
    {"title":"Space Sandwich Showdown","genre":"comedy","year":2005,"rating":7.0,"description":"In a culinary clash of cosmic proportions, chefs compete to create the ultimate space sandwich."},
    {"title":"The Wizard's Whimsy","genre":"fantasy","year":2004,"rating":7.4,"description":"A whimsical wizard embarks on a magical journey to reclaim his lost spellbook from a mischievous dragon."},
    {"title":"The Last Sasquatch","genre":"action","year":2003,"rating":7.1,"description":"A legendary creature holds the key to saving a remote wilderness from corporate greed and environmental destruction."},
    {"title":"Nightmare on Pizza Street","genre":"horror","year":2002,"rating":6.7,"description":"An ancient curse turns a popular pizzeria into a nightmarish haunt for unsuspecting patrons."},
    {"title":"Robo-Rodeo","genre":"sci-fi","year":2001,"rating":7.2,"description":"In a futuristic frontier town, robotic cowboys compete in a high-tech rodeo for fame and fortune."},
    {"title":"The Enchanted Elixir Emporium","genre":"romance","year":2000,"rating":7.8,"description":"A magical elixir shop becomes the backdrop for a tale of love, destiny, and the pursuit of happiness."},
    {"title":"The Mysterious Mummy's Curse","genre":"thriller","year":1999,"rating":6.9,"description":"A cursed mummy awakens from its slumber, unleashing ancient horrors upon an unsuspecting archaeological team."},
    {"title":"Whispers in the Wind","genre":"fantasy","year":1998,"rating":7.1,"description":"In a land where secrets are carried on the wind, a young heroine embarks on a quest to uncover the truth about her mysterious heritage."},
    {"title":"Mars Attacks!","genre":"comedy","year":1996,"rating":6.6,"description":"Martian invaders wreak havoc on Earth, but humanity fights back with unexpected humor."},
    {"title":"The Phantom Panda","genre":"action","year":1994,"rating":7.0,"description":"A masked vigilante panda fights crime and corruption in the heart of a bustling metropolis."},
    {"title":"Carnival of Carnage","genre":"horror","year":1992,"rating":6.5,"description":"A traveling carnival harbors a dark secret, unleashing a wave of terror upon the unsuspecting townsfolk."},
    {"title":"The Quantum Quest","genre":"sci-fi","year":1990,"rating":7.3,"description":"A daring crew embarks on a perilous quest to unlock the mysteries of quantum physics and save their endangered planet."},
    {"title":"Pirates of the Chocolate Sea","genre":"comedy","year":1989,"rating":7.6,"description":"A crew of chocolate-loving pirates sets sail in search of a fabled cocoa treasure hidden on a mythical island."},
    {"title":"The Mummy's Curse","genre":"horror","year":1987,"rating":6.8,"description":"An ancient curse awakens a vengeful mummy, who stalks the night in search of those who disturbed its tomb."},
    {"title":"Cyber City Showdown","genre":"action","year":1986,"rating":7.2,"description":"In a neon-lit cyberpunk city, rival factions clash in a high-stakes battle for control of the digital underworld."},
    {"title":"Ghosts in the Machine","genre":"sci-fi","year":1985,"rating":6.7,"description":"A computer virus takes on a life of its own, manifesting as malevolent spirits within a cutting-edge AI."},
    {"title":"The Witch's Brew","genre":"fantasy","year":1984,"rating":7.0,"description":"A young apprentice must master the art of potion-making to save her village from an ancient evil."},
    {"title":"Nightmare on Elm Street","genre":"horror","year":1984,"rating":7.5,"description":"A vengeful spirit haunts the dreams of teenagers, unleashing deadly nightmares in the real world."},
    {"title":"The Quest for Atlantis","genre":"action","year":1983,"rating":6.9,"description":"Adventurers embark on a daring quest to uncover the lost city of Atlantis and its mythical treasures."},
    {"title":"Escape from Robot Island","genre":"sci-fi","year":1982,"rating":7.1,"description":"A group of survivors must outwit a rogue AI and its robotic minions to escape from a remote island."},
    {"title":"The Magic Mirror","genre":"fantasy","year":1981,"rating":7.3,"description":"A mystical mirror reveals hidden truths and dark secrets, testing the bonds of friendship and love."},
    {"title":"The Phantom of the Opera","genre":"romance","year":1980,"rating":7.8,"description":"A mysterious masked figure falls in love with a beautiful opera singer, but his obsession leads to tragedy."},
    {"title":"The Lost World","genre":"thriller","year":1979,"rating":6.9,"description":"Explorers discover a hidden realm inhabited by prehistoric creatures, but their expedition soon turns deadly."},
    {"title":"Raiders of the Lost Ark","genre":"action","year":1981,"rating":8.4,"description":"Archaeologist Indiana Jones races against Nazi agents to find the legendary Ark of the Covenant."},
    {"title":"Ghostbusters","genre":"comedy","year":1984,"rating":7.8,"description":"Paranormal investigators battle a surge of supernatural activity in New York City."},
    {"title":"Back to the Future","genre":"sci-fi","year":1985,"rating":8.5,"description":"A teenager travels back in time and inadvertently alters the course of history, prompting a frantic effort to restore the future."},
    {"title":"The Shining","genre":"horror","year":1980,"rating":8.4,"description":"A writer and his family become caretakers of an isolated hotel, where supernatural forces drive him to madness."},
    {"title":"E.T. the Extra-Terrestrial","genre":"sci-fi","year":1982,"rating":7.8,"description":"A young boy befriends an extraterrestrial stranded on Earth, leading to a heartwarming adventure."},
    {"title":"Die Hard","genre":"action","year":1988,"rating":8.2,"description":"An off-duty cop battles terrorists who seize a skyscraper during a Christmas party."},
    {"title":"Beetlejuice","genre":"comedy","year":1988,"rating":7.5,"description":"A recently deceased couple hires a mischievous spirit to drive out the new occupants of their former home."},
    {"title":"Blade Runner","genre":"sci-fi","year":1982,"rating":8.1,"description":"A detective hunts down rogue replicants in a dystopian future, leading to a confrontation that questions the nature of humanity."},
    {"title":"Jurassic Park","genre":"action","year":1993,"rating":8.1,"description":"Scientists clone dinosaurs for a theme park, but chaos erupts when the creatures break free."},
    {"title":"The Lion King","genre":"animation","year":1994,"rating":8.5,"description":"A young lion prince flees his kingdom only to learn the true meaning of responsibility and bravery."},
    {"title":"Forrest Gump","genre":"drama","year":1994,"rating":8.8,"description":"The story of a man with a low IQ who rose above his challenges, proving that determination and kindness can change the world."},
    {"title":"The Silence of the Lambs","genre":"thriller","year":1991,"rating":8.6,"description":"A young FBI cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims."},
    {"title":"The Sixth Sense","genre":"thriller","year":1999,"rating":8.1,"description":"A young boy who communicates with spirits that don't know they're dead seeks the help of a disheartened child psychologist."},
    {"title":"Gladiator","genre":"action","year":2000,"rating":8.5,"description":"A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery."},
    {"title":"A Beautiful Mind","genre":"biography","year":2001,"rating":8.2,"description":"After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish."},
    {"title":"The Departed","genre":"crime","year":2006,"rating":8.5,"description":"An undercover cop and a mole in the police force race to identify each other while infiltrating an Irish gang in South Boston."},
    {"title":"The Dark Knight","genre":"action","year":2008,"rating":9.0,"description":"When the menace known as the Joker emerges from his mysterious past, he wreaks havoc and chaos on the people of Gotham."},
    {"title":"Avatar","genre":"action","year":2009,"rating":7.8,"description":"A paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home."},
    {"title":"Inception","genre":"action","year":2010,"rating":8.8,"description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O."},
    {"title":"Interstellar","genre":"adventure","year":2014,"rating":8.6,"description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival."},
    {"title":"The Prestige","genre":"drama","year":2006,"rating":8.5,"description":"After a tragic accident, two stage magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other."},
    {"title":"The Revenant","genre":"adventure","year":2015,"rating":8.0,"description":"A frontiersman on a fur trading expedition in the 1820s fights for survival after being mauled by a bear and left for dead by members of his own hunting team."},
    {"title":"Mad Max: Fury Road","genre":"action","year":2015,"rating":8.1,"description":"In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search of her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max."},
    {"title":"La La Land","genre":"comedy","year":2016,"rating":8.0,"description":"While navigating their careers in Los Angeles, a pianist and an actress fall in love while attempting to reconcile their aspirations for the future."},
    {"title":"Wonder Woman","genre":"action","year":2017,"rating":7.4,"description":"When a pilot crashes and tells of conflict in the outside world, Diana, an Amazonian warrior in training, leaves home to fight a war, discovering her full powers and true destiny."},
    {"title":"Avengers: Infinity War","genre":"action","year":2018,"rating":8.4,"description":"The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe."},
    {"title":"Black Panther","genre":"action","year":2018,"rating":7.3,"description":"T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country's past."},
    {"title":"Parasite","genre":"comedy","year":2019,"rating":8.6,"description":"Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan."},
    {"title":"Joker","genre":"crime","year":2019,"rating":8.4,"description":"In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society, and he embarks on a downward spiral of revolution and bloody crime."},
    {"title":"Spider-Man: No Way Home","genre":"action","year":2021,"rating":8.5,"description":"With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to uncover what it truly means to be Spider-Man."},
    {"title":"Dune","genre":"adventure","year":2021,"rating":8.3,"description":"Feature adaptation of Frank Herbert's science fiction novel about the son of a noble family entrusted with the protection of the most valuable asset and most vital element in the galaxy."},
    {"title":"La Révolte des Oeufs de Pâques","genre":"comedy","year":2010,"rating":7.3,"description":"When Easter eggs rebel against their creators, chaos ensues in this hilarious family adventure."},
    {"title":"Le Mystère du Château Hanté","genre":"horror","year":2015,"rating":6.8,"description":"In a remote French castle, guests uncover dark secrets as they face supernatural forces."},
    {"title":"Les Aventures du Chat Volant","genre":"fantasy","year":2012,"rating":7.1,"description":"A magical flying cat leads two children on a whimsical journey through the French countryside."},
    {"title":"L'Énigme du Diamant Perdu","genre":"action","year":2018,"rating":6.9,"description":"A daring heist to recover a legendary diamond takes place amidst the glamour of Paris."},
    {"title":"La Princesse et le Chevalier Mécanique","genre":"sci-fi","year":2020,"rating":7.5,"description":"In a steampunk Paris, a brave princess and a gallant knight battle an evil inventor to save the city."},
    {"title":"Le Secret du Jardin Enchanté","genre":"fantasy","year":2013,"rating":7.2,"description":"Hidden within a magical garden lies a treasure that two siblings must protect from dark forces."},
    {"title":"Les Pirates du Croissant Magique","genre":"comedy","year":2017,"rating":7.4,"description":"A group of bumbling pirates embarks on a quest for a magical croissant that grants unlimited wishes."},
    {"title":"L'École des Sorciers Maladroits","genre":"fantasy","year":2014,"rating":7.0,"description":"At a school for clumsy wizards, a misfit student uncovers a plot that threatens the magical world."},
    {"title":"La Légende du Trésor Maudit","genre":"adventure","year":2016,"rating":7.3,"description":"A daring expedition across France leads treasure hunters to a cursed fortune hidden for centuries."},
    {"title":"Le Mystère de la Forêt Endormie","genre":"mystery","year":2019,"rating":7.6,"description":"In a sleepy French village, children investigate why the forest suddenly falls into an enchanted slumber."},
    {"title":"Les Chevaliers de la Baguette Magique","genre":"comedy","year":2011,"rating":7.2,"description":"A group of quirky bakers discovers that their baguettes have magical powers, leading to chaotic and hilarious consequences."},
    {"title":"L'Île des Dinosaures Disparus","genre":"sci-fi","year":2021,"rating":7.8,"description":"On a remote French island, scientists unearth a lost world of dinosaurs, triggering a battle for survival."},
    {"title":"La Vengeance du Chat Noir","genre":"action","year":2013,"rating":7.1,"description":"A vigilante cat in Paris seeks justice for its owner's mysterious disappearance, uncovering a web of crime."},
    {"title":"Le Mystère du Manoir Hanté","genre":"horror","year":2017,"rating":6.9,"description":"Guests at a secluded French manor confront their deepest fears when they encounter restless spirits."},
    {"title":"Les Aventuriers de la Pierre de Lune","genre":"adventure","year":2018,"rating":7.5,"description":"Two young explorers embark on a perilous journey to uncover the secrets of a legendary moonstone."},
    {"title":"L'Évasion du Château Enchanté","genre":"fantasy","year":2015,"rating":7.3,"description":"A group of plucky children must outwit the magical defenses of an enchanted castle to rescue their friend."},
    {"title":"Le Secret des Marionnettes Magiques","genre":"comedy","year":2012,"rating":7.0,"description":"Puppeteers in a quaint French town discover that their marionettes have a mind of their own, leading to uproarious antics."},
    {"title":"La Malédiction du Masque Ancien","genre":"horror","year":2016,"rating":6.8,"description":"An ancient mask unleashes terror on unsuspecting visitors at a Parisian museum, prompting a desperate quest to undo its curse."},
    {"title":"Les Exploits du Pirate Fantôme","genre":"action","year":2019,"rating":7.4,"description":"A legendary ghost pirate returns to reclaim his lost treasure, challenging a brave group of adventurers."},
    {"title":"L'Énigme du Manoir Abandonné","genre":"mystery","year":2014,"rating":7.2,"description":"In a remote French estate, friends investigate the haunting secrets of an abandoned manor, risking their lives to uncover the truth."},
    {"title":"Le Trésor Caché de la Rivière Mystique","genre":"adventure","year":2020,"rating":7.7,"description":"A map to a hidden treasure sends a group of treasure hunters on a thrilling expedition down the mystical rivers of France."},
    {"title":"La Conspiration des Chapeaux Magiques","genre":"comedy","year":2011,"rating":7.1,"description":"In a world where hats grant superpowers, a group of misfits must stop an evil milliner from using them for world domination."},
    {"title":"Les Secrets de la Forêt Enchantée","genre":"fantasy","year":2022,"rating":7.9,"description":"Deep within a magical forest, siblings uncover ancient secrets that could save their kingdom from darkness."},
    {"title":"L'Énigme du Vieux Phare","genre":"mystery","year":2013,"rating":7.3,"description":"A young detective investigates the mysteries surrounding an abandoned lighthouse on the French coast."},
    {"title":"Le Trésor Perdu des Chevaliers Français","genre":"adventure","year":2017,"rating":7.6,"description":"An archaeological dig in France unearths clues to a lost treasure guarded by legendary knights."},
    {"title":"Les Enfants du Temps Perdu","genre":"drama","year":2015,"rating":7.5,"description":"In a small French village, children embark on a poignant journey to reconnect with their past and preserve their heritage."},
    {"title":"Samurai Cat: The Legend Begins","genre":"action","year":2016,"rating":7.8,"description":"A brave samurai cat embarks on a quest to save his village from an evil warlord, blending humor and adventure."},
    {"title":"Spirit of the Cherry Blossom","genre":"drama","year":2018,"rating":8.2,"description":"In the serene hills of Kyoto, a young artist discovers the hidden meaning behind the fleeting beauty of cherry blossoms."},
    {"title":"Ninja Scroll: Shadows of Destiny","genre":"action","year":2019,"rating":7.5,"description":"A rogue ninja battles against a powerful clan to protect a sacred artifact that holds the key to his past."},
    {"title":"Memoirs of a Geisha","genre":"romance","year":2005,"rating":8.0,"description":"A young geisha navigates the complexities of love and tradition in 1920s Kyoto, painting a vivid portrait of her life."},
    {"title":"Whispers of the Kami","genre":"fantasy","year":2021,"rating":7.9,"description":"A young shrine maiden discovers her ability to communicate with ancient spirits, leading her on a mystical journey."},
    {"title":"Tokyo Drifters","genre":"crime","year":2017,"rating":7.6,"description":"In the neon-lit streets of Tokyo, a group of street racers becomes entangled in the dangerous world of organized crime."},
    {"title":"The Tale of Princess Kaguya","genre":"animation","year":2013,"rating":8.5,"description":"A magical retelling of the classic Japanese folktale about a celestial princess born from a bamboo shoot."},
    {"title":"Sakura and the Samurai","genre":"romance","year":2014,"rating":7.8,"description":"A forbidden love blossoms between a samurai warrior and a spirited geisha against the backdrop of feudal Japan."},
    {"title":"My Neighbor Totoro","genre":"animation","year":1988,"rating":8.9,"description":"Two sisters encounter friendly forest spirits in rural Japan, discovering the magic of nature and friendship."},
    {"title":"Journey to the Floating World","genre":"fantasy","year":2020,"rating":7.7,"description":"A young fisherman embarks on a perilous quest to save his village from a vengeful sea spirit in ancient Japan."},
    {"title":"Kyoto Shadows","genre":"mystery","year":2015,"rating":7.4,"description":"A detective investigates a series of bizarre murders in Kyoto, uncovering a web of intrigue that spans centuries."},
    {"title":"The Last Ronin","genre":"action","year":2012,"rating":7.9,"description":"A lone samurai seeks vengeance against a corrupt shogun in this epic tale of honor and sacrifice."},
    {"title":"Haru's Promise","genre":"drama","year":2011,"rating":7.3,"description":"A young girl makes a solemn vow to protect her family's honor amidst the turmoil of World War II-era Japan."},
    {"title":"Ghost in the Shell","genre":"sci-fi","year":1995,"rating":8.4,"description":"In a cyberpunk future, a cyborg detective hunts down a mysterious hacker who threatens the boundaries between man and machine."},
    {"title":"Memoirs of an Onsen Geisha","genre":"romance","year":2016,"rating":7.7,"description":"Amidst the tranquil hot springs of Hokkaido, a geisha finds love and redemption in unexpected places."},
    {"title":"Samurai Spirit","genre":"action","year":2013,"rating":7.6,"description":"A young samurai must master his inner demons to protect a sacred scroll from falling into the wrong hands."},
    {"title":"The Tale of the White Fox","genre":"fantasy","year":2019,"rating":7.8,"description":"A fox spirit disguises itself as a beautiful woman to experience human emotions, testing the boundaries of love and identity."},
    {"title":"Tokyo Noir","genre":"crime","year":2014,"rating":7.5,"description":"A hard-boiled detective navigates the seedy underbelly of Tokyo, unraveling a conspiracy that threatens to tear the city apart."},
    {"title":"Whisper of the Wind","genre":"drama","year":2017,"rating":7.9,"description":"In the aftermath of World War II, a young orphan discovers hope and healing in the kindness of strangers."},
    {"title":"The Hidden Blade","genre":"action","year":2004,"rating":8.1,"description":"A humble samurai must choose between duty and love as the winds of change sweep through feudal Japan."},
    {"title":"Spirit of the Samurai","genre":"action","year":2018,"rating":7.7,"description":"A masterless samurai embarks on a quest for redemption, confronting his past while battling dark forces that threaten his homeland."},
    {"title":"The Princess and the Moonlit Garden","genre":"romance","year":2015,"rating":7.8,"description":"A princess and a humble gardener forge an unlikely bond amidst the serene beauty of a moonlit garden."},
    {"title":"Shinobi: The Shadow Warrior","genre":"action","year":2010,"rating":7.4,"description":"A skilled ninja must protect a powerful artifact from falling into the hands of a ruthless warlord."},
    {"title":"Mysteries of the Floating World","genre":"mystery","year":2016,"rating":7.6,"description":"A detective investigates a series of supernatural phenomena in Edo-period Japan, uncovering secrets that defy explanation."},
    {"title":"The Ghost Samurai","genre":"horror","year":2013,"rating":7.3,"description":"A vengeful samurai returns from the dead to seek justice against those who betrayed him, haunting the misty forests of Japan."},
    {"title":"Sakura Blossoms","genre":"drama","year":2019,"rating":7.8,"description":"A young woman's journey to honor her family's legacy unfolds amidst the timeless beauty of cherry blossom season in Kyoto."},
    {"title":"The Secret of the Mystic Temple","genre":"fantasy","year":2015,"rating":7.8,"description":"Two siblings embark on an extraordinary adventure to unlock the ancient secrets hidden within a mystical Indian temple."},
    {"title":"Chai and Conversation","genre":"comedy","year":2017,"rating":7.4,"description":"In the bustling streets of Mumbai, a chai wallah's life takes a whimsical turn when he becomes the unwitting hero of a local comedy club."},
    {"title":"The Maharaja's Lost Ruby","genre":"action","year":2018,"rating":7.6,"description":"A daring treasure hunter races against time and a ruthless villain to recover a legendary ruby stolen from an Indian palace."},
    {"title":"The Monsoon Wedding Planner","genre":"romance","year":2016,"rating":7.9,"description":"Amidst the vibrant festivities of a monsoon wedding, two hearts discover love against the backdrop of family drama and cultural traditions."},
    {"title":"The Jungle Chronicles","genre":"adventure","year":2019,"rating":8.0,"description":"In the heart of the Indian jungle, a young explorer uncovers a hidden world of mythical creatures and ancient mysteries."},
    {"title":"Bollywood Dreams","genre":"drama","year":2020,"rating":7.7,"description":"A struggling actress navigates the glittering world of Bollywood, facing challenges and discovering her true passion for cinema."},
    {"title":"Taj Mahal: A Love Story","genre":"romance","year":2014,"rating":7.5,"description":"Two star-crossed lovers defy the odds and cultural barriers to find their eternal love story against the majestic backdrop of the Taj Mahal."},
    {"title":"The Curry Conundrum","genre":"comedy","year":2013,"rating":7.2,"description":"A culinary enthusiast embarks on a hilarious quest across India to uncover the secret recipe of a legendary curry, encountering quirky characters along the way."},
    {"title":"Mumbai Noir","genre":"thriller","year":2017,"rating":7.8,"description":"In the gritty underworld of Mumbai, a determined detective hunts down a notorious crime lord, risking everything to bring him to justice."},
    {"title":"The Enchanted Sari","genre":"fantasy","year":2012,"rating":7.4,"description":"A magical sari weaves together the destinies of three women across generations, revealing the timeless power of love and courage."},
    {"title":"The Palace Heist","genre":"action","year":2015,"rating":7.6,"description":"A team of skilled thieves orchestrates a daring heist to reclaim stolen treasures from an Indian palace, facing danger at every turn."},
    {"title":"The Mystical Veil","genre":"drama","year":2018,"rating":7.9,"description":"A young woman discovers her ancestral connection to a mystical veil that holds the key to unlocking her family's hidden past."},
    {"title":"The Serpent's Curse","genre":"action","year":2016,"rating":7.7,"description":"A fearless archaeologist races against time to stop a sinister cult from unleashing an ancient curse that threatens the world."},
    {"title":"The Tiger's Roar","genre":"adventure","year":2019,"rating":8.1,"description":"A courageous wildlife photographer embarks on a perilous journey to capture the elusive tiger in its natural habitat, risking everything for the perfect shot."},
    {"title":"The Monsoon Bride","genre":"romance","year":2020,"rating":7.8,"description":"In the midst of a monsoon season, a young bride embarks on a transformative journey of self-discovery and love."},
    {"title":"The Emerald Dagger","genre":"thriller","year":2014,"rating":7.5,"description":"A cunning detective must unravel a web of deceit and betrayal surrounding a priceless emerald dagger that holds the key to a deadly conspiracy."},
    {"title":"The Sacred River","genre":"drama","year":2017,"rating":7.8,"description":"Against the backdrop of the sacred Ganges River, three lives intertwine in a tale of redemption, forgiveness, and the power of faith."},
    {"title":"The Palace of Whispers","genre":"mystery","year":2015,"rating":7.6,"description":"A journalist uncovers dark secrets buried within the walls of an ancient palace, risking her life to expose a hidden truth."},
    {"title":"The Midnight Masquerade","genre":"romance","year":2013,"rating":7.3,"description":"At a lavish masquerade ball, two strangers embark on a romantic journey that defies societal norms and challenges their hearts."},
    {"title":"The Hidden Pearl","genre":"adventure","year":2018,"rating":7.7,"description":"A young pearl diver discovers a rare treasure that sparks a dangerous quest across the Indian Ocean, testing her courage and resilience."},
    {"title":"The Ruby of Jaipur","genre":"action","year":2016,"rating":7.4,"description":"A fearless archaeologist races against time to uncover the legendary ruby of Jaipur before it falls into the wrong hands."},
    {"title":"The Enchanted Forest","genre":"fantasy","year":2012,"rating":7.2,"description":"Deep within an enchanted forest, a young girl discovers a magical world where dreams come alive and mythical creatures roam."},
    {"title":"The Palace Intrigue","genre":"thriller","year":2017,"rating":7.9,"description":"In the corridors of power, a young politician must navigate a treacherous maze of deceit and betrayal to uncover the truth behind a political conspiracy."},
    {"title":"The Monsoon Bride","genre":"romance","year":2014,"rating":7.7,"description":"In the midst of a monsoon season, a young bride embarks on a transformative journey of self-discovery and love."},
    {"title":"The Mystical Veil","genre":"drama","year":2018,"rating":7.5,"description":"A young woman discovers her ancestral connection to a mystical veil that holds the key to unlocking her family's hidden past."},
    {"title":"The Serpent's Curse","genre":"action","year":2016,"rating":7.8,"description":"A fearless archaeologist races against time to stop a sinister cult from unleashing an ancient curse that threatens the world."},
    {"title":"La Leyenda del Castillo Encantado","genre":"fantasy","year":2016,"rating":7.8,"description":"Dos hermanos se embarcan en una aventura extraordinaria para desbloquear los antiguos secretos ocultos dentro de un místico castillo español."},
    {"title":"El Café de las Sonrisas","genre":"comedy","year":2017,"rating":7.4,"description":"En las bulliciosas calles de Madrid, la vida de un vendedor de café da un giro caprichoso cuando se convierte en el héroe involuntario de un club de comedia local."},
    {"title":"El Rubí Perdido del Marqués","genre":"action","year":2018,"rating":7.6,"description":"Un intrépido cazador de tesoros compite contra el tiempo y un villano despiadado para recuperar un rubí legendario robado de un palacio español."},
    {"title":"La Boda Monzónica","genre":"romance","year":2016,"rating":7.9,"description":"En medio de las vibrantes festividades de una boda monzónica, dos corazones descubren el amor contra el telón de fondo del drama familiar y las tradiciones culturales."},
    {"title":"Las Crónicas de la Selva","genre":"adventure","year":2019,"rating":8.0,"description":"En el corazón de la selva española, un joven explorador descubre un mundo oculto de criaturas míticas y antiguos misterios."},
    {"title":"Sueños Bollywoodenses","genre":"drama","year":2020,"rating":7.7,"description":"Una actriz en apuros navega por el reluciente mundo de Bollywood, enfrentando desafíos y descubriendo su verdadera pasión por el cine."},
    {"title":"La Historia de Amor del Taj Mahal","genre":"romance","year":2014,"rating":7.5,"description":"Dos amantes separados por el destino desafían las barreras culturales y las probabilidades para encontrar su historia de amor eterno contra el majestuoso telón de fondo del Taj Mahal."},
    {"title":"El Enigma del Curry","genre":"comedy","year":2013,"rating":7.2,"description":"Un entusiasta culinario se embarca en una hilarante búsqueda por toda India para descubrir la receta secreta de un curry legendario, encontrando personajes peculiares en el camino."},
    {"title":"Noche en Mumbai","genre":"thriller","year":2017,"rating":7.8,"description":"En el sórdido submundo de Mumbai, un detective determinado persigue a un notorio señor del crimen, arriesgando todo para llevarlo ante la justicia."},
    {"title":"El Sari Encantado","genre":"fantasy","year":2012,"rating":7.4,"description":"Un sari mágico entrelaza los destinos de tres mujeres a lo largo de las generaciones, revelando el poder eterno del amor y el coraje."},
    {"title":"El Robo del Palacio","genre":"action","year":2015,"rating":7.6,"description":"Un equipo de ladrones expertos orquesta un audaz robo para recuperar tesoros robados de un palacio español, enfrentándose al peligro en cada giro."},
    {"title":"El Velo Místico","genre":"drama","year":2018,"rating":7.9,"description":"Una joven descubre su conexión ancestral con un velo místico que encierra la clave para desbloquear el pasado oculto de su familia."},
    {"title":"La Maldición de la Serpiente","genre":"action","year":2016,"rating":7.7,"description":"Un valiente arqueólogo se embarca en una carrera contra el tiempo para detener a un siniestro culto que intenta desatar una antigua maldición que amenaza al mundo."},
    {"title":"El Rugido del Tigre","genre":"adventure","year":2019,"rating":8.1,"description":"Un valiente fotógrafo de vida silvestre se embarca en un peligroso viaje para capturar al esquivo tigre en su hábitat natural, arriesgando todo por la toma perfecta."},
    {"title":"La Novia Monzónica","genre":"romance","year":2020,"rating":7.8,"description":"En medio de la temporada de monzones, una joven novia emprende un viaje transformador de autodescubrimiento y amor."},
    {"title":"El Daga de Esmeralda","genre":"thriller","year":2014,"rating":7.5,"description":"Un astuto detective debe desentrañar una red de engaños y traiciones en torno a una daga de esmeralda invaluable que encierra la clave de una conspiración mortal."},
    {"title":"El Río Sagrado","genre":"drama","year":2017,"rating":7.8,"description":"Con el telón de fondo del sagrado río Ganges, tres vidas se entrelazan en un relato de redención, perdón y el poder de la fe."},
    {"title":"Los Intrigas del Palacio","genre":"mystery","year":2015,"rating":7.6,"description":"Un periodista descubre oscuros secretos enterrados dentro de las paredes de un antiguo palacio, arriesgando su vida para exponer una verdad oculta."},
    {"title":"El Baile de Medianoche","genre":"romance","year":2013,"rating":7.3,"description":"En un lujoso baile de máscaras, dos desconocidos emprenden un viaje romántico que desafía las normas sociales y pone a prueba sus corazones."},
    {"title":"La Perla Escondida","genre":"adventure","year":2018,"rating":7.7,"description":"Una joven buceadora de perlas descubre un tesoro raro que desencadena una búsqueda peligrosa a través del océano Índico, poniendo a prueba su coraje y resistencia."},
    {"title":"El Rubí de Jaipur","genre":"action","year":2016,"rating":7.4,"description":"Un valiente arqueólogo se embarca en una carrera contra el tiempo para desenterrar el legendario rubí de Jaipur antes de que caiga en las manos equivocadas."},
    {"title":"El Bosque Encantado","genre":"fantasy","year":2012,"rating":7.2,"description":"En lo profundo de un bosque encantado, una joven descubre un mundo mágico donde los sueños cobran vida y las criaturas míticas deambulan."},
    {"title":"La Intriga del Palacio","genre":"thriller","year":2017,"rating":7.9,"description":"En los pasillos del poder, un joven político debe navegar por un laberinto traicionero de engaños y traiciones para descubrir la verdad detrás de una conspiración política."},
    {"title":"The Midnight Sun Mystery","genre":"thriller","year":2016,"rating":7.8,"description":"A detective investigates a series of mysterious disappearances in a remote Finnish village, uncovering dark secrets hidden beneath the midnight sun."},
    {"title":"The Enchanted Forest of Lapland","genre":"fantasy","year":2017,"rating":7.4,"description":"In the magical forests of Lapland, a young explorer discovers a portal to a mystical world where ancient legends come to life."},
    {"title":"Snow Angels","genre":"drama","year":2018,"rating":7.6,"description":"In the harsh winter of Finland, two strangers find solace and redemption in each other's company, forging an unlikely bond amidst the snow."},
    {"title":"The Arctic Conspiracy","genre":"action","year":2016,"rating":7.9,"description":"A brave scientist uncovers a deadly conspiracy in the Arctic Circle, racing against time to prevent a catastrophic environmental disaster."},
    {"title":"The Northern Lights Affair","genre":"romance","year":2015,"rating":8.0,"description":"Two soulmates find love under the mesmerizing glow of the Northern Lights, embarking on a journey of passion and self-discovery."},
    {"title":"The Ice Queen's Secret","genre":"fantasy","year":2020,"rating":7.7,"description":"A young girl discovers her magical heritage in the icy realm of Finland, unlocking the secrets of her royal lineage."},
    {"title":"The Helsinki Heist","genre":"action","year":2014,"rating":7.5,"description":"A team of daring thieves plans a high-stakes heist in the heart of Helsinki, navigating treacherous obstacles to pull off the ultimate robbery."},
    {"title":"The Reindeer Whisperer","genre":"comedy","year":2013,"rating":7.2,"description":"A quirky animal whisperer communicates with reindeer in Finland's vast wilderness, leading to hilarious misadventures and heartwarming encounters."},
    {"title":"Midsummer Madness","genre":"romance","year":2017,"rating":7.8,"description":"During Finland's magical Midsummer festival, two strangers embark on a whimsical journey of love and self-discovery amidst the midnight sun."},
    {"title":"The Mysteries of Moomin Valley","genre":"animation","year":2019,"rating":8.1,"description":"In the whimsical world of Moomin Valley, a curious family of trolls unravels mysteries and embarks on fantastical adventures."},
    {"title":"The Arctic Explorer","genre":"adventure","year":2018,"rating":7.7,"description":"A fearless explorer braves the frozen landscapes of Finland's Arctic Circle, encountering perilous challenges and unexpected allies."},
    {"title":"The Kalevala Chronicles","genre":"fantasy","year":2016,"rating":7.6,"description":"Inspired by Finnish mythology, a young hero embarks on a quest to restore balance to the mystical realms of Kalevala."},
    {"title":"The Sauna Scandal","genre":"comedy","year":2015,"rating":7.3,"description":"A hilarious mix-up at a remote Finnish sauna sparks a chain of comedic events that brings together an unlikely group of characters."},
    {"title":"The Midnight Ski Adventure","genre":"action","year":2014,"rating":7.8,"description":"A group of thrill-seekers embarks on a daring ski adventure under the midnight sun, facing exhilarating challenges and unexpected dangers."},
    {"title":"The Snowflake Symphony","genre":"drama","year":2013,"rating":7.5,"description":"In the quiet town of Kuusamo, a music teacher inspires her students to embrace the beauty of individuality through a mesmerizing snowflake-themed concert."},
    {"title":"The Sámi Shaman's Secret","genre":"fantasy","year":2020,"rating":7.9,"description":"A young Sámi apprentice discovers her shamanic powers and embarks on a mystical journey to protect her people from dark forces."},
    {"title":"The Arctic Aurora Affair","genre":"romance","year":2012,"rating":7.7,"description":"Amidst the breathtaking beauty of Finland's Arctic Aurora, two strangers find love and healing in the embrace of the Northern Lights."},
    {"title":"The Forest Guardian","genre":"fantasy","year":2017,"rating":7.6,"description":"A brave forest guardian protects Finland's ancient woodlands from environmental threats and human greed, risking everything for the sake of nature."},
    {"title":"The Helsinki Hustle","genre":"action","year":2018,"rating":7.4,"description":"In the bustling streets of Helsinki, a street-smart hustler navigates the underworld of crime, seeking redemption and revenge."},
    {"title":"The Mysterious Moose Manor","genre":"mystery","year":2019,"rating":7.8,"description":"A curious detective investigates strange occurrences at a remote Finnish manor, uncovering a web of secrets hidden within its walls."},
    {"title":"The Ice Skater's Dream","genre":"drama","year":2016,"rating":7.5,"description":"A talented ice skater chases her Olympic dreams in Finland's snowy landscapes, overcoming personal challenges and heartbreak."},
    {"title":"The Northern Nomad","genre":"adventure","year":2015,"rating":7.2,"description":"A free-spirited traveler explores Finland's rugged wilderness, forging deep connections with nature and the people she meets along the way."},
    {"title":"The Viking Legacy","genre":"action","year":2014,"rating":7.7,"description":"In the footsteps of Finland's ancient Vikings, a fearless warrior embarks on a quest for honor and glory in a world of ruthless battles and epic adventures."},
    {"title":"The Midnight Sun Mystery","genre":"thriller","year":2016,"rating":7.8,"description":"A detective investigates a series of mysterious disappearances in a remote Finnish village, uncovering dark secrets hidden beneath the midnight sun."},
    {"title":"Toy Story","genre":"animation","year":1995,"rating":8.3,"description":"A cowboy doll and his space ranger pal embark on a journey to be reunited with their owner."},
    {"title":"Finding Nemo","genre":"animation","year":2003,"rating":8.1,"description":"A clownfish embarks on an epic journey to rescue his son who has been captured by a diver."},
    {"title":"The Lion King","genre":"animation","year":1994,"rating":8.5,"description":"A young lion prince flees his kingdom only to learn the true meaning of responsibility and bravery."},
    {"title":"Frozen","genre":"animation","year":2013,"rating":7.4,"description":"Two sisters must break a curse that has trapped their kingdom in eternal winter."},
    {"title":"Wreck-It Ralph","genre":"animation","year":2012,"rating":7.7,"description":"A video game villain wants to be a hero and sets out to fulfill his dream, but his quest brings havoc to the whole arcade."},
    {"title":"Monsters, Inc.","genre":"animation","year":2001,"rating":8.0,"description":"In a city of monsters, two creatures discover that a child can power their world."},
    {"title":"Coco","genre":"animation","year":2017,"rating":8.4,"description":"Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer."},
    {"title":"The Incredibles","genre":"animation","year":2004,"rating":8.0,"description":"A family of superheroes comes out of retirement to save the world."},
    {"title":"Zootopia","genre":"animation","year":2016,"rating":8.0,"description":"In a city of anthropomorphic animals, a rookie bunny cop and a cynical con artist fox must work together to uncover a conspiracy."},
    {"title":"Aladdin","genre":"animation","year":1992,"rating":8.0,"description":"A kind-hearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true."},
    {"title":"Shrek","genre":"animation","year":2001,"rating":7.8,"description":"An ogre, in order to regain his swamp, travels along with an annoying donkey in order to bring a princess to a scheming lord, wishing himself King."},
    {"title":"The Little Mermaid","genre":"animation","year":1989,"rating":7.6,"description":"A mermaid princess makes a Faustian bargain in an attempt to become human and win a prince's love."},
    {"title":"Ratatouille","genre":"animation","year":2007,"rating":8.0,"description":"A rat who can cook makes an unusual alliance with a young kitchen worker at a famous Parisian restaurant."},
    {"title":"Beauty and the Beast","genre":"animation","year":1991,"rating":8.0,"description":"A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love."},
    {"title":"Up","genre":"animation","year":2009,"rating":8.2,"description":"Seventy-eight-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway."},
    {"title":"Moana","genre":"animation","year":2016,"rating":7.6,"description":"In Ancient Polynesia, when a terrible curse incurred by the Demigod Maui reaches Moana's island, she answers the Ocean's call to seek out the Demigod to set things right."},
    {"title":"Inside Out","genre":"animation","year":2015,"rating":8.1,"description":"After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school."},
    {"title":"Toy Story 3","genre":"animation","year":2010,"rating":8.2,"description":"The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home."},
    {"title":"Finding Dory","genre":"animation","year":2016,"rating":7.3,"description":"Friendly but forgetful blue tang Dory begins a search for her long-lost parents, and everyone learns a few things about the real meaning of family along the way."},
    {"title":"Cars","genre":"animation","year":2006,"rating":7.1,"description":"A hot-shot race-car named Lightning McQueen gets waylaid in Radiator Springs, where he finds the true meaning of friendship and family."},
    {"title":"Mulan","genre":"animation","year":1998,"rating":7.6,"description":"To save her father from death in the army, a young maiden secretly goes in his place and becomes one of China's greatest heroines in the process."},
    {"title":"Brave","genre":"animation","year":2012,"rating":7.1,"description":"Determined to make her own path in life, Princess Merida defies a custom that brings chaos to her kingdom. Granted one wish, Merida must rely on her bravery and her archery skills to undo a beastly curse."},
    {"title":"Big Hero 6","genre":"animation","year":2014,"rating":7.8,"description":"A special bond develops between plus-sized inflatable robot Baymax and prodigy Hiro Hamada, who together team up with a group of friends to form a band of high-tech heroes."},
    {"title":"The Nightmare Before Christmas","genre":"animation","year":1993,"rating":8.0,"description":"Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion."},
    {"title":"Shrek 2","genre":"animation","year":2004,"rating":7.2,"description":"Princess Fiona's parents invite her and Shrek to dinner to celebrate her marriage. If only they knew the newlyweds were both ogres."}
]
